Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_acquire.c
/*
 * motor_acquire.c
 * ----------------------------------------------------------------------------
 * Real-sensor data source. Replaces motor_synth.c (do not link both: TIM2
 * collision, HAL_TIM_PeriodElapsedCallback collision, motor_on_block_ready
 * collision).
 *
 * Architecture (v4, 8 ADC channels)
 * ==================================
 *
 *   TIM3 @ sample_rate_hz  ----TRGO---->  ADC1 SCAN of PA0..PA7 (IN0..IN7)
 *                                            |  (8 conversions per trigger)
 *                                            +-DMA2 Stream 0 Ch 0 (circular)-->
 *                                                |
 *                                                +-> s_adc_buf[2 * block_rows * 3]
 *                                                       |               |
 *                                          half-cplt ---+               +--- full-cplt
 *                                                |                       |
 *                                                v                       v
 *                                          fill_rows(0)           fill_rows(3*block_rows)
 *                                                  \                    /
 *                                                   v                  v
 *                                              motor_on_block_ready(rows, n_rows)
 *
 *   TIM2 update @ imu_rate_hz  ---> HAL_I2C_Mem_Read_IT(MPU6050 ACCEL_X, 6 bytes)
 *                                          |
 *                                          v MemRxCplt
 *                                   s_vib_{x,y,z} (volatile cache, ZOH-read by fill_rows)
 *
 *   TIM4 CH3 (PB8) input capture, 1 MHz counter ---> period_us between pulses
 *                                                          |
 *                                                          v
 *                                              s_rpm = 60_000_000 / period_us
 *
 * ADC uses SCAN mode with NbrOfConversion=8. Each TIM3 trigger initiates a
 * scan of the 8 channels in rank order; DMA writes 8 half-words per trigger.
 * Buffer layout after N triggers: [ ch0_0..ch7_0, ch0_1..ch7_1, ... ].
 * fill_rows unpacks N_CURRENT_CH-at-a-time into motor_row_t.current[0..7].
 * ----------------------------------------------------------------------------
 */
#include "stm32f4xx_hal.h"
#include <string.h>
#include "motor_wire.h"
#include "motor_source.h"
#include "motor_acquire.h"

extern void Error_Handler(void);

#ifndef MOTOR_DEFAULT_BLOCK_ROWS
#define MOTOR_DEFAULT_BLOCK_ROWS  200u
#endif

#define ACQUIRE_DEFAULT_SAMPLE_RATE_HZ  20000u
#define ACQUIRE_DEFAULT_IMU_RATE_HZ     1000u
#define ACQUIRE_MIN_IMU_RATE_HZ         10u
#define ACQUIRE_MAX_IMU_RATE_HZ         1000u

#define N_CURRENT_CH                    8u   /* PA0..PA7 (ADC1 IN0..IN7)         */

/* MPU6050 addressing and register map. AD0 low -> 0x68.                       */
#define MPU6050_ADDR_8       (0x68u << 1)   /* AD0 low  */
#define MPU6050_ADDR_8_ALT   (0x69u << 1)   /* AD0 high or floating */

/* How often to re-probe for an absent IMU, in TIM2 ticks. At the default
 * 1 kHz that is once a second -- cheap, and it means an MPU that is late to
 * power up, or reconnected while running, is picked up instead of being
 * written off at boot. */
#define IMU_REPROBE_TICKS    1000u
#define MPU_REG_SMPLRT       0x19u
#define MPU_REG_CONFIG       0x1Au
#define MPU_REG_GYRO_CFG     0x1Bu
#define MPU_REG_ACCEL_CFG    0x1Cu
#define MPU_REG_ACCEL_XOUT_H 0x3Bu
#define MPU_REG_PWR_MGMT_1   0x6Bu

#define TIM_PCLK_HZ          84000000u   /* TIM2/3/4 input clock                */

/* ---- HAL handles --------------------------------------------------------- */
static ADC_HandleTypeDef s_hadc1;
static DMA_HandleTypeDef s_hdma_adc;
static TIM_HandleTypeDef s_htim2;    /* IMU I2C poll @ imu_rate_hz             */
static TIM_HandleTypeDef s_htim3;    /* ADC scan trigger @ sample_rate_hz      */
static TIM_HandleTypeDef s_htim4;    /* RPM tach input capture (PB8, CH3)      */
static I2C_HandleTypeDef s_hi2c1;

/* ---- buffers ------------------------------------------------------------- */
/* ADC circular DMA target: 2 halves x block_rows rows x 3 channels per row.
 * Sized for MAX so runtime block_rows changes just adjust the DMA count.     */
static uint16_t    s_adc_buf[2u * MOTOR_MAX_ROWS_PER_BLOCK * N_CURRENT_CH];
static motor_row_t s_row_buf[2][MOTOR_MAX_ROWS_PER_BLOCK];
static volatile uint8_t s_row_idx = 0;
static uint8_t s_i2c_buf[6];

/* ---- live sensor cache (set by ISRs, read by fill_rows) ------------------ */
static volatile int16_t  s_vib_x = 0;
static volatile int16_t  s_vib_y = 0;
static volatile int16_t  s_vib_z = 0;
static volatile uint16_t s_rpm   = 0;
static volatile uint32_t s_last_capture = 0;
static volatile uint8_t  s_capture_seen = 0;
static volatile uint32_t s_rpm_last_ms  = 0;

/* Report 0 rather than a stale reading once the tach goes quiet.
 *
 * s_rpm was only ever assigned inside the capture interrupt, so when the shaft
 * stopped the last measured value stayed in every row forever -- a stopped
 * motor published its old running speed indefinitely.
 *
 * 200 ms is comfortably longer than the slowest period the 16-bit 1 MHz counter
 * can even represent (65.5 ms, ~915 RPM), so this cannot fire on a shaft that
 * is still turning fast enough to be measured at all. */
#define RPM_STALE_MS  200u

/* ---- active config ------------------------------------------------------- */
static uint16_t s_block_rows;
static uint32_t s_sample_rate_hz;
static uint32_t s_imu_rate_hz;
static uint8_t  s_running  = 0;
static uint8_t  s_have_imu  = 0;
static uint8_t  s_mpu_addr  = MPU6050_ADDR_8;  /* whichever answered */
static volatile uint32_t s_imu_absent_ticks = 0;

/* ---- deferred reconfig flags (set in ISR apply, drained in service) ------ */
static volatile uint8_t  s_pending_run_state    = 0xFFu;
static volatile uint32_t s_pending_sample_rate  = 0u;
static volatile uint32_t s_pending_imu_rate     = 0u;
static volatile uint16_t s_pending_block_rows   = 0u;

