Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_acquire.c
/* ---- diagnostic counters (extern in main.c for LED stages) --------------- */
volatile uint32_t g_adc_cb    = 0;
volatile uint32_t g_imu_reads = 0;
/* Absence used to be completely silent: s_have_imu==0 made the TIM2 callback
 * return without touching any counter, so g_imu_reads and g_imu_errs both sat
 * at 0 and there was no way to tell "no IMU fitted" from "IMU never polled".
 * These two make the difference visible.                                    */
volatile uint32_t g_imu_absent    = 0;   /* polls skipped, no IMU present   */
volatile uint32_t g_imu_addr_found = 0;  /* 7-bit address, 0 = none         */
volatile uint32_t g_imu_errs  = 0;
volatile uint32_t g_rpm_caps  = 0;

/* Dynamic prescaler+ARR search to land a 16-bit (PSC, ARR) pair from Hz. */
static void compute_psc_arr(uint32_t target_hz, uint32_t *out_psc, uint32_t *out_arr)
{
    uint64_t total = (uint64_t)TIM_PCLK_HZ / target_hz;
    if (total == 0) total = 1;
    uint32_t presc = 1;
    while ((total + presc - 1) / presc > 0x10000u) {
        presc <<= 1;
        if (presc > 0x10000u) { presc = 0x10000u; break; }
    }
    uint32_t arr = (uint32_t)((total + presc - 1) / presc);
    if (arr == 0)       arr = 1;
    if (arr > 0x10000u) arr = 0x10000u;
    *out_psc = presc - 1u;
    *out_arr = arr - 1u;
}

/* ==========================================================================
 * ADC1 (3-channel scan) + TIM3 + DMA2 Stream 0
 * ========================================================================*/

static void adc_gpio_init(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
    GPIO_InitTypeDef g = {0};
    g.Pin  = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3   /* PA0..PA7   */
           | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;  /* IN0..IN7   */
    g.Mode = GPIO_MODE_ANALOG;
    g.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &g);
}

static void adc_dma_init(void)
{
    __HAL_RCC_DMA2_CLK_ENABLE();

    s_hdma_adc.Instance                 = DMA2_Stream0;
    s_hdma_adc.Init.Channel             = DMA_CHANNEL_0;
    s_hdma_adc.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    s_hdma_adc.Init.PeriphInc           = DMA_PINC_DISABLE;
    s_hdma_adc.Init.MemInc              = DMA_MINC_ENABLE;
    s_hdma_adc.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    s_hdma_adc.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    s_hdma_adc.Init.Mode                = DMA_CIRCULAR;
    s_hdma_adc.Init.Priority            = DMA_PRIORITY_HIGH;
    s_hdma_adc.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&s_hdma_adc) != HAL_OK) Error_Handler();
    __HAL_LINKDMA(&s_hadc1, DMA_Handle, s_hdma_adc);

    HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
}

static void adc_init(void)
{
    __HAL_RCC_ADC1_CLK_ENABLE();

    s_hadc1.Instance                   = ADC1;
    s_hadc1.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
    s_hadc1.Init.Resolution            = ADC_RESOLUTION_12B;
    s_hadc1.Init.ScanConvMode          = ENABLE;              /* multi-channel */
    s_hadc1.Init.ContinuousConvMode    = DISABLE;
    s_hadc1.Init.DiscontinuousConvMode = DISABLE;
    s_hadc1.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING;
    s_hadc1.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T3_TRGO;
    s_hadc1.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    s_hadc1.Init.NbrOfConversion       = N_CURRENT_CH;        /* 3 per trigger */
    s_hadc1.Init.DMAContinuousRequests = ENABLE;
    s_hadc1.Init.EOCSelection          = ADC_EOC_SINGLE_CONV; /* DMA per conv  */
    if (HAL_ADC_Init(&s_hadc1) != HAL_OK) Error_Handler();

    ADC_ChannelConfTypeDef ch = {0};
    ch.SamplingTime = ADC_SAMPLETIME_15CYCLES;

    /* Ranks 1..N map to ADC1 IN0..IN(N-1) == PA0..PA(N-1), contiguous, so the
     * channel number equals the loop index (ADC_CHANNEL_0..7 are the plain
     * integers 0..7 on the F4 HAL). NOTE: this identity only holds up to 8
     * channels -- IN8 is PB0, IN9 is PB1, so a count > 8 must extend
     * adc_gpio_init() to the correct ports and can no longer use i as the
     * channel number. Also mind the scan budget: N * (15+12) ADC cycles at
     * PCLK2/4 = 21 MHz must fit inside one sample period (8 ch = 10.3 us; fine
     * at 20 kHz / 50 us, but drop SamplingTime to 3 cycles above ~90 kHz).   */
    for (uint32_t i = 0; i < N_CURRENT_CH; ++i) {
        ch.Channel = i;
        ch.Rank    = i + 1u;
        if (HAL_ADC_ConfigChannel(&s_hadc1, &ch) != HAL_OK) Error_Handler();
    }
}

static void tim3_program(uint32_t sample_rate_hz)
{
    if (sample_rate_hz == 0) sample_rate_hz = ACQUIRE_DEFAULT_SAMPLE_RATE_HZ;

    uint32_t psc, arr;
    compute_psc_arr(sample_rate_hz, &psc, &arr);

    s_htim3.Init.Prescaler         = psc;
    s_htim3.Init.CounterMode       = TIM_COUNTERMODE_UP;
    s_htim3.Init.Period            = arr;
    s_htim3.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    s_htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&s_htim3) != HAL_OK) Error_Handler();

    TIM_MasterConfigTypeDef m = {0};
    m.MasterOutputTrigger = TIM_TRGO_UPDATE;
    m.MasterSlaveMode     = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&s_htim3, &m) != HAL_OK)
        Error_Handler();
}

static void tim3_init(uint32_t sample_rate_hz)
{
    __HAL_RCC_TIM3_CLK_ENABLE();
    s_htim3.Instance = TIM3;
    tim3_program(sample_rate_hz);
}

/* ==========================================================================
 * I2C1 + MPU6050 + TIM2 (configurable IMU poll rate)
 * ========================================================================*/

static void i2c1_init(void)
{
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIO_InitTypeDef g = {0};
    g.Pin       = GPIO_PIN_6 | GPIO_PIN_7;     /* SCL=PB6, SDA=PB7           */
    g.Mode      = GPIO_MODE_AF_OD;
    g.Pull      = GPIO_PULLUP;
    g.Speed     = GPIO_SPEED_FREQ_HIGH;
    g.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &g);

    __HAL_RCC_I2C1_CLK_ENABLE();
    s_hi2c1.Instance             = I2C1;
    s_hi2c1.Init.ClockSpeed      = 400000;
    s_hi2c1.Init.DutyCycle       = I2C_DUTYCYCLE_2;
    s_hi2c1.Init.OwnAddress1     = 0;
    s_hi2c1.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    s_hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    s_hi2c1.Init.OwnAddress2     = 0;
    s_hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    s_hi2c1.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;
    if (HAL_I2C_Init(&s_hi2c1) != HAL_OK) Error_Handler();

    HAL_NVIC_SetPriority(I2C1_EV_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
    HAL_NVIC_SetPriority(I2C1_ER_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(I2C1_ER_IRQn);
}

