Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_acquire.c
static HAL_StatusTypeDef mpu_write(uint8_t reg, uint8_t val)
{
    return HAL_I2C_Mem_Write(&s_hi2c1, s_mpu_addr, reg,
                             I2C_MEMADD_SIZE_8BIT, &val, 1, 100);
}

/* Probe both possible addresses and keep the one that answers.
 *
 * AD0 low is 0x68 and AD0 high is 0x69, and the old code only ever looked at
 * 0x68 -- so a board with AD0 tied high, or left floating and reading high, was
 * reported as "no IMU" forever. Trying both costs one extra probe at startup.
 *
 * Returns 1 if an MPU answered and was configured. */
static uint8_t mpu6050_try_init(void)
{
    static const uint8_t addrs[2] = { MPU6050_ADDR_8, MPU6050_ADDR_8_ALT };

    for (unsigned i = 0; i < 2; ++i) {
        if (HAL_I2C_IsDeviceReady(&s_hi2c1, addrs[i], 2, 50) != HAL_OK)
            continue;

        s_mpu_addr = addrs[i];

        /* Check the writes. Previously their results were discarded, so a
         * device that answered the probe but failed to configure -- a wiring
         * fault appearing under load, say -- looked fully initialised and then
         * produced nothing. */
        if (mpu_write(MPU_REG_PWR_MGMT_1, 0x00) != HAL_OK) continue;
        if (mpu_write(MPU_REG_SMPLRT,     0x00) != HAL_OK) continue;
        if (mpu_write(MPU_REG_CONFIG,     0x00) != HAL_OK) continue;
        if (mpu_write(MPU_REG_GYRO_CFG,   0x00) != HAL_OK) continue;
        if (mpu_write(MPU_REG_ACCEL_CFG,  0x00) != HAL_OK) continue;

        g_imu_addr_found = addrs[i] >> 1;
        return 1u;
    }
    return 0u;
}

static void mpu6050_init(void)
{
    s_have_imu = mpu6050_try_init();
}

static void tim2_program(uint32_t imu_rate_hz)
{
    if (imu_rate_hz == 0)                       imu_rate_hz = ACQUIRE_DEFAULT_IMU_RATE_HZ;
    if (imu_rate_hz < ACQUIRE_MIN_IMU_RATE_HZ)  imu_rate_hz = ACQUIRE_MIN_IMU_RATE_HZ;
    if (imu_rate_hz > ACQUIRE_MAX_IMU_RATE_HZ)  imu_rate_hz = ACQUIRE_MAX_IMU_RATE_HZ;

    uint32_t psc, arr;
    compute_psc_arr(imu_rate_hz, &psc, &arr);

    s_htim2.Init.Prescaler         = psc;
    s_htim2.Init.CounterMode       = TIM_COUNTERMODE_UP;
    s_htim2.Init.Period            = arr;
    s_htim2.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    s_htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&s_htim2) != HAL_OK) Error_Handler();
}

static void tim2_init(uint32_t imu_rate_hz)
{
    __HAL_RCC_TIM2_CLK_ENABLE();
    s_htim2.Instance = TIM2;
    tim2_program(imu_rate_hz);
    HAL_NVIC_SetPriority(TIM2_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

/* ==========================================================================
 * TIM4 CH3 input capture (RPM tach on PB8)
 * ========================================================================*/

static void tim4_init(void)
{
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIO_InitTypeDef g = {0};
    g.Pin       = GPIO_PIN_8;
    g.Mode      = GPIO_MODE_AF_PP;
    g.Pull      = GPIO_PULLDOWN;
    g.Speed     = GPIO_SPEED_FREQ_LOW;
    g.Alternate = GPIO_AF2_TIM4;
    HAL_GPIO_Init(GPIOB, &g);

    __HAL_RCC_TIM4_CLK_ENABLE();
    s_htim4.Instance               = TIM4;
    s_htim4.Init.Prescaler         = 84u - 1u;    /* 1 MHz tick, 1 us res    */
    s_htim4.Init.CounterMode       = TIM_COUNTERMODE_UP;
    s_htim4.Init.Period            = 0xFFFFu;
    s_htim4.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    s_htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_IC_Init(&s_htim4) != HAL_OK) Error_Handler();

    TIM_IC_InitTypeDef ic = {0};
    ic.ICPolarity  = TIM_INPUTCHANNELPOLARITY_RISING;
    ic.ICSelection = TIM_ICSELECTION_DIRECTTI;
    ic.ICPrescaler = TIM_ICPSC_DIV1;
    ic.ICFilter    = 0x3;
    if (HAL_TIM_IC_ConfigChannel(&s_htim4, &ic, TIM_CHANNEL_3) != HAL_OK)
        Error_Handler();

    HAL_NVIC_SetPriority(TIM4_IRQn, 7, 0);
    HAL_NVIC_EnableIRQ(TIM4_IRQn);
}

/* ==========================================================================
 * Row composition (called from ADC DMA half/full IRQ)
 * ========================================================================*/

static void fill_rows(uint32_t adc_hword_offset)
{
    uint8_t         idx = s_row_idx;
    motor_row_t    *dst = s_row_buf[idx];
    const uint16_t *src = &s_adc_buf[adc_hword_offset];

    /* Snapshot the cached IMU + RPM once per block. ZOH across all rows. */
    int16_t  vx  = s_vib_x;
    int16_t  vy  = s_vib_y;
    int16_t  vz  = s_vib_z;
    uint16_t rpm = s_rpm;

    /* Age out a stale tach reading before it is stamped into another block. */
    if (s_capture_seen && (HAL_GetTick() - s_rpm_last_ms) > RPM_STALE_MS) {
        s_rpm          = 0u;
        s_capture_seen = 0u;
        rpm            = 0u;
    }

    uint16_t n = s_block_rows;
    for (uint16_t i = 0; i < n; ++i) {
        /* Scan order in the DMA buffer matches the ADC channel ranks 1..N. */
        for (uint32_t c = 0; c < N_CURRENT_CH; ++c)
            dst[i].current[c] = src[i * N_CURRENT_CH + c];
        dst[i].vib_x   = vx;
        dst[i].vib_y   = vy;
        dst[i].vib_z   = vz;
        dst[i].rpm     = rpm;
    }
    s_row_idx ^= 1u;
    g_adc_cb++;
    motor_on_block_ready(dst, n);
}

/* ==========================================================================
 * HAL callbacks
 * ========================================================================*/

void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance != ADC1) return;
    fill_rows(0);
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance != ADC1) return;
    fill_rows((uint32_t)s_block_rows * N_CURRENT_CH);
}

void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->Instance != I2C1) return;
    s_vib_x = (int16_t)(((uint16_t)s_i2c_buf[0] << 8) | s_i2c_buf[1]);
    s_vib_y = (int16_t)(((uint16_t)s_i2c_buf[2] << 8) | s_i2c_buf[3]);
    s_vib_z = (int16_t)(((uint16_t)s_i2c_buf[4] << 8) | s_i2c_buf[5]);
    g_imu_reads++;
}

void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->Instance != I2C1) return;
    g_imu_errs++;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance != TIM2) return;

    if (!s_have_imu) {
        /* Count it, so an absent IMU is visible rather than silent, and retry
         * occasionally instead of giving up for the lifetime of the board. */
        g_imu_absent++;
        if (++s_imu_absent_ticks >= IMU_REPROBE_TICKS) {
            s_imu_absent_ticks = 0;
            s_have_imu = mpu6050_try_init();
        }
        return;
    }
    if (HAL_I2C_Mem_Read_IT(&s_hi2c1, MPU6050_ADDR_8,
                            MPU_REG_ACCEL_XOUT_H,
                            I2C_MEMADD_SIZE_8BIT,
                            s_i2c_buf, 6) != HAL_OK) {
        g_imu_errs++;
    }
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance != TIM4) return;
    uint32_t now = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_3);
    if (s_capture_seen) {
        uint32_t period_us = (now - s_last_capture) & 0xFFFFu;
        if (period_us > 0u) {
            uint32_t rpm = 60000000UL / period_us;
            if (rpm > 65535u) rpm = 65535u;
            s_rpm = (uint16_t)rpm;
        }
    } else {
        s_capture_seen = 1u;
    }
    s_last_capture = now;
    s_rpm_last_ms  = HAL_GetTick();
    g_rpm_caps++;
}

