Mintharah/SPI-Stm32-QNX/Stm32-SPI/src/motor_acquire.c
/* ==========================================================================
 * NVIC handlers (vector table entries)
 * ========================================================================*/

void DMA2_Stream0_IRQHandler(void) { HAL_DMA_IRQHandler(&s_hdma_adc); }
void ADC_IRQHandler(void)          { HAL_ADC_IRQHandler(&s_hadc1);    }
void I2C1_EV_IRQHandler(void)      { HAL_I2C_EV_IRQHandler(&s_hi2c1); }
void I2C1_ER_IRQHandler(void)      { HAL_I2C_ER_IRQHandler(&s_hi2c1); }
void TIM2_IRQHandler(void)         { HAL_TIM_IRQHandler(&s_htim2);    }
void TIM4_IRQHandler(void)         { HAL_TIM_IRQHandler(&s_htim4);    }

/* ==========================================================================
 * Public API
 * ========================================================================*/

void motor_acquire_init(uint16_t block_rows, uint32_t sample_rate_hz, uint32_t imu_rate_hz)
{
    if (block_rows == 0 || block_rows > MOTOR_MAX_ROWS_PER_BLOCK)
        block_rows = MOTOR_DEFAULT_BLOCK_ROWS;
    if (sample_rate_hz == 0u)
        sample_rate_hz = ACQUIRE_DEFAULT_SAMPLE_RATE_HZ;
    if (imu_rate_hz == 0u)
        imu_rate_hz = ACQUIRE_DEFAULT_IMU_RATE_HZ;
    if (imu_rate_hz < ACQUIRE_MIN_IMU_RATE_HZ) imu_rate_hz = ACQUIRE_MIN_IMU_RATE_HZ;
    if (imu_rate_hz > ACQUIRE_MAX_IMU_RATE_HZ) imu_rate_hz = ACQUIRE_MAX_IMU_RATE_HZ;

    s_block_rows     = block_rows;
    s_sample_rate_hz = sample_rate_hz;
    s_imu_rate_hz    = imu_rate_hz;

    adc_gpio_init();
    adc_dma_init();
    adc_init();
    tim3_init(sample_rate_hz);

    i2c1_init();
    mpu6050_init();
    tim2_init(imu_rate_hz);

    tim4_init();
}

void motor_acquire_start(void)
{
    if (s_running) return;
    /* DMA count = 2 (halves) * block_rows (rows/half) * N_CURRENT_CH (samples/row) */
    if (HAL_ADC_Start_DMA(&s_hadc1, (uint32_t *)s_adc_buf,
                          2u * s_block_rows * N_CURRENT_CH) != HAL_OK)
        Error_Handler();
    if (HAL_TIM_Base_Start(&s_htim3) != HAL_OK) Error_Handler();
    if (HAL_TIM_Base_Start_IT(&s_htim2) != HAL_OK) Error_Handler();
    if (HAL_TIM_IC_Start_IT(&s_htim4, TIM_CHANNEL_3) != HAL_OK)
        Error_Handler();
    s_running = 1;
}

void motor_acquire_stop(void)
{
    if (!s_running) return;
    HAL_TIM_IC_Stop_IT(&s_htim4, TIM_CHANNEL_3);
    HAL_TIM_Base_Stop_IT(&s_htim2);
    HAL_TIM_Base_Stop(&s_htim3);
    HAL_ADC_Stop_DMA(&s_hadc1);
    s_running = 0;
}

void motor_acquire_set_block_rows(uint16_t block_rows)
{
    if (block_rows == 0 || block_rows > MOTOR_MAX_ROWS_PER_BLOCK) return;
    s_pending_block_rows = block_rows;
}

void motor_acquire_set_sample_rate(uint32_t sample_rate_hz)
{
    if (sample_rate_hz == 0u) return;
    s_pending_sample_rate = sample_rate_hz;
}

void motor_acquire_set_imu_rate(uint32_t imu_rate_hz)
{
    if (imu_rate_hz == 0u) return;
    if (imu_rate_hz < ACQUIRE_MIN_IMU_RATE_HZ) imu_rate_hz = ACQUIRE_MIN_IMU_RATE_HZ;
    if (imu_rate_hz > ACQUIRE_MAX_IMU_RATE_HZ) imu_rate_hz = ACQUIRE_MAX_IMU_RATE_HZ;
    s_pending_imu_rate = imu_rate_hz;
}

void motor_acquire_set_run_state(uint8_t run_state)
{
    if (run_state > 1u) return;
    s_pending_run_state = run_state;
}

void motor_acquire_service(void)
{
    /* ADC/TIM3 group: sample_rate + block_rows together (DMA needs re-arm). */
    uint32_t new_rate = s_pending_sample_rate;
    uint16_t new_rows = s_pending_block_rows;
    if (new_rate != 0u || new_rows != 0u) {
        s_pending_sample_rate = 0u;
        s_pending_block_rows  = 0u;
        uint8_t was_running = s_running;
        if (was_running) {
            HAL_ADC_Stop_DMA(&s_hadc1);
            HAL_TIM_Base_Stop(&s_htim3);
        }
        if (new_rate != 0u) {
            s_sample_rate_hz = new_rate;
            tim3_program(new_rate);
        }
        if (new_rows != 0u) {
            s_block_rows = new_rows;
        }
        if (was_running) {
            HAL_TIM_Base_Start(&s_htim3);
            HAL_ADC_Start_DMA(&s_hadc1, (uint32_t *)s_adc_buf,
                              2u * s_block_rows * N_CURRENT_CH);
        }
    }

    /* TIM2 / IMU rate (independent of ADC group). */
    uint32_t new_imu = s_pending_imu_rate;
    if (new_imu != 0u) {
        s_pending_imu_rate = 0u;
        uint8_t was_running = s_running;
        if (was_running) HAL_TIM_Base_Stop_IT(&s_htim2);
        s_imu_rate_hz = new_imu;
        tim2_program(new_imu);
        if (was_running) HAL_TIM_Base_Start_IT(&s_htim2);
    }

    /* Run state deferred so the ACK frame ships before ADC actually stops. */
    uint8_t r = s_pending_run_state;
    if (r != 0xFFu) {
        s_pending_run_state = 0xFFu;
        if (r == 0u) motor_acquire_stop();
        else         motor_acquire_start();
    }
}